online_results/output_length/_520/opt-2.7b/_128__2000/log_15930264.out
WARNING 02-21 19:13:36 _custom_ops.py:19] Failed to import from vllm._C with ModuleNotFoundError("No module named 'vllm._C'")
Namespace(backend='openai', base_url=None, host='localhost', port=9572, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/data/dummy_dataset_mean.json', model='/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=2000, logprobs=None, request_rate=inf, seed=0, trust_remote_code=False, disable_tqdm=True, profile=False, save_result=True, metadata=None, result_dir='online_results/output_length/_520/opt-2.7b/_128__2000', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', launch_server=True, server_args='--port=9572 --enable-chunked-prefill --disable-log-requests --model=/gpfs/scratch/bsc98/bsc098069/llm_benchmarking/models/opt/opt-2.7b --max-num-seqs=128', launch_server_with_nsight=False, disable_log_stats=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=520, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None)
Server started
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
============ Serving Benchmark Result ============
Successful requests:                     2000      
Benchmark duration (s):                  206.48    
Total input tokens:                      484000    
Total generated tokens:                  1040000   
Request throughput (req/s):              9.69      
Output token throughput (tok/s):         5036.80   
Total Token throughput (tok/s):          7380.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          96814.09  
Median TTFT (ms):                        93363.46  
P99 TTFT (ms):                           196855.36 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.69     
Median TPOT (ms):                        25.09     
P99 TPOT (ms):                           25.38     
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.69     
Median ITL (ms):                         23.71     
P99 ITL (ms):                            38.00     
==================================================
Concurrent checker terminated
Server terminated